export const Area = {
  city: [
    {
      name: '서울',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '경기',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '인천',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '대전광역시',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '대구광역시',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '부산광역시',
      gu: [
        { name: '해운대구', dong: ['중1동', '중2동'] },
        { name: '부산진구', dong: ['부전동', '전포동'] },
      ],
    },
    {
      name: '울산광역시',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '광주광역시',
      gu: [
        { name: '광산구', dong: [] },
        { name: '남구', dong: [] },
        { name: '동구', dong: [] },
        { name: '북구', dong: [] },
        { name: '서구', dong: [] },
      ],
    },
    {
      name: '강원도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '충청북도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },

    {
      name: '충청남도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },

    {
      name: '경상북도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '경상남도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '전라북도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '전라남도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
    {
      name: '제주도',
      gu: [
        { name: '서귀포시', dong: [] },
        { name: '제주시', dong: [] },
      ],
    },
    {
      name: '경상남도',
      gu: [
        { name: '강남구', dong: ['역삼동', '논현동'] },
        { name: '송파구', dong: ['잠실동', '가락동'] },
      ],
    },
  ],
};
